In [117]:
import pandas as pd
import numpy as np

In [149]:
students = [{'Name': 'Inam', 'Age': 42}, {'Name': 'Mohsin', 'Age': 26}, {'Name': 'Mohsin', 'Age': 26}, {'Name': 'Mohsin', 'Age': 26}, {'Name': 'Mohsin', 'Age': 26}, {'Name': 'Mohsin', 'Age': 26}, {'Name': 'Mohsin', 'Age': 26}, {'Name': 'Mohsin', 'Age': 26}, {'Name': 'Mohsin', 'Age': 26}, {'Name': 'Mohsin', 'Age': 26}]

In [12]:
students2 = {'Name': ['Inam', 'Mohsin'], 'Age': [42, 26]}

In [152]:
df = pd.DataFrame(students2)

In [153]:
df

     Name  Age
0    Inam   42
1  Mohsin   26

In [154]:
df2 = pd.DataFrame(students2, index=['a', 'b'])

In [155]:
df2

     Name  Age
a    Inam   42
b  Mohsin   26

In [156]:
del df2['Age']

In [157]:
df2

     Name
a    Inam
b  Mohsin

In [29]:
df['GPA'] = 3.5

In [30]:
df

   Age    Name  GPA
0   42    Inam  3.5
1   26  Mohsin  3.5
2   26  Mohsin  3.5
3   26  Mohsin  3.5
4   26  Mohsin  3.5
5   26  Mohsin  3.5
6   26  Mohsin  3.5
7   26  Mohsin  3.5
8   26  Mohsin  3.5
9   26  Mohsin  3.5

In [158]:
khi_temps_dict = [{'Temp': 45, 'Date': '1/1/21'}, {'Temp': 40, 'Date': '2/1/21'}, {'Temp': 42, 'Date': '3/1/21'}, {'Temp': 39, 'Date': '4/1/21'}]

In [159]:
khi_temps = pd.DataFrame(khi_temps_dict, index=['10:00', '13:00', '14:00', '21:00'])

In [160]:
khi_temps

         Date  Temp
10:00  1/1/21    45
13:00  2/1/21    40
14:00  3/1/21    42
21:00  4/1/21    39

In [161]:
khi_temps.index.name = 'Time of Temp'

In [162]:
khi_temps

                Date  Temp
Time of Temp
10:00         1/1/21    45
13:00         2/1/21    40
14:00         3/1/21    42
21:00         4/1/21    39

In [174]:
khi_temps.columns.name = 'Temp. Data for Khi.'

In [175]:
khi_temps

Temp. Data for Khi.    Date  Temp
Time of Temp
10:00                1/1/21    45
13:00                2/1/21    40
14:00                3/1/21    42
21:00                4/1/21    39

In [165]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
....: 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [166]:
frame = pd.DataFrame(pop)

In [167]:
frame

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [168]:
pdata = {'Ohio': frame['Ohio'][:-1],
....: 'Nevada': frame['Nevada'][:2]}

In [169]:
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64, 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [170]:
frame_new = pd.DataFrame(pdata)

In [171]:
frame_new

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [172]:
frame_new.index = [2004, 2005]

In [176]:
khi_temps

Temp. Data for Khi.    Date  Temp
Time of Temp
10:00                1/1/21    45
13:00                2/1/21    40
14:00                3/1/21    42
21:00                4/1/21    39

In [177]:
khi_temps = khi_temps.reindex(['10:00', '16:00', '17:00', '18:00', '19:00', '21:00', '22:00'], method='ffill')

In [178]:
khi_temps

Temp. Data for Khi.    Date  Temp
Time of Temp
10:00                1/1/21    45
16:00                3/1/21    42
17:00                3/1/21    42
18:00                3/1/21    42
19:00                3/1/21    42
21:00                4/1/21    39
22:00                4/1/21    39

In [180]:
khi_temps['Temp'][0] = 31
khi_temps

C:\Users\MT-2019.MIT_R9_PC2\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

Temp. Data for Khi.    Date  Temp
Time of Temp
10:00                1/1/21    31
16:00                3/1/21    42
17:00                3/1/21    42
18:00                3/1/21    42
19:00                3/1/21    42
21:00                4/1/21    39
22:00                4/1/21    39

In [181]:
khi_temps.loc[['10:00', '18:00'], ['Temp', 'Date']]

Temp. Data for Khi.  Temp    Date
Time of Temp
10:00                  31  1/1/21
18:00                  42  3/1/21

In [99]:
khi_temps

         Date  Temp
10:00  1/1/21    45
16:00  3/1/21    42
17:00  3/1/21    42
18:00  3/1/21    42
19:00  3/1/21    42
21:00  4/1/21    39
22:00  4/1/21    39

In [107]:
khi_temps.loc[['10:00', '21:00'], ['Temp', 'Date']]

       Temp    Date
10:00    45  1/1/21
21:00    39  4/1/21

In [182]:
khi_temps.iloc[[0,5], [1, 0]]

Temp. Data for Khi.  Temp    Date
Time of Temp
10:00                  31  1/1/21
21:00                  39  4/1/21

In [185]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [186]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [118]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [188]:
saylani_student_data = {'Name': ['Inam', 'Mohsin'], 'Age': [42, 26]}
boyscou_student_data = {'Name': ['Ali Naqvi', 'Fayyaz', 'Sameer'], 'Age': [22, 21, 22]}
students_saylani = pd.DataFrame(saylani_student_data, index=['Teacher', 'Teacher'])
students_boyscout = pd.DataFrame(boyscou_student_data, index=['Teacher', 'Teacher', 'Student'])

In [189]:
students_boyscout

              Name  Age
Teacher  Ali Naqvi   22
Teacher     Fayyaz   21
Student     Sameer   22

In [190]:
students_saylani

           Name  Age
Teacher    Inam   42
Teacher  Mohsin   26

In [191]:
del students_boyscout['Name']

In [192]:
students_boyscout

         Age
Teacher   22
Teacher   21
Student   22

In [193]:
students_boyscout['Age'].add(students_saylani['Age'], fill_value=-1)

Student    21.0
Teacher    64.0
Teacher    48.0
Teacher    63.0
Teacher    47.0
Name: Age, dtype: float64

In [148]:
students_boyscout.apply(lambda x: x.max())

Age    24
dtype: int64

In [144]:
res

Teacher    None
Teacher    None
Student    None
Name: Age, dtype: object